In [1]:
import numpy as np
import pandas as pd

In [113]:
data = pd.read_csv("train.csv")
data.head()
print(len(data))
data.columns

891

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [114]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [115]:
subset = data[(data.Pclass == 3) & (data.Parch == 1) & (data.Sex == 'male') & (data.Fare >= 10) & (data.Age == 2) & (data.SibSp == 3)]

In [116]:
subset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,NaN,S

In [117]:
data = data[["Pclass", "Parch", "SibSp", "Fare", "Sex", "Age", "Survived"]]

In [118]:
def convert_sex_to_int(napis):
    return 1 if napis == 'male' else 0

In [119]:
data.Sex = data.Sex.apply(convert_sex_to_int)

In [120]:
data = data.dropna().reset_index(drop=True)
X = data.drop("Survived", axis=1)
Y = data.Survived

In [122]:
clf = tree.DecisionTreeClassifier()
clf = clf.fit(X, Y)

In [123]:
clf

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [125]:
X.head()

   Pclass  Parch  SibSp     Fare  Sex   Age
0       3      0      1   7.2500    1  22.0
1       1      0      1  71.2833    0  38.0
2       3      0      0   7.9250    0  26.0
3       1      0      1  53.1000    0  35.0
4       3      0      0   8.0500    1  35.0

In [127]:
observation = pd.DataFrame({"Pclass": [3], 
                            "Parch": [1], 
                            "SibSp": [3], 
                            "Fare": [10], 
                            "Sex": [1],
                            "Age": [2]})

In [128]:
observation

   Pclass  Parch  SibSp  Fare  Sex  Age
0       3      1      3    10    1    2

In [130]:
clf.predict(observation)

array([0])

In [131]:
clf.predict_proba(observation)

array([[1., 0.]])